import type { SceneData } from '../../interface/Scene'
import {
  CoreCharacteristicEnum,
  SkillEnum,
  EffectType,
  CheckDifficulty,
} from '../../constant/enums'

export const scenes_241_260: SceneData = {
  '241': {
    id: '241',
    story:
      '你甩掉了熊，回到道路上，心脏咚咚地锤打着你的胸腔。你又奔跑了几分钟，直到你确认它不再理会你，才停了下来。',
    options: [
      {
        type: 'goto',
        text: '继续',
        goto: '223',
        effects: [
          {
            type: EffectType.MARK_SKILL_SUCCESS,
            target: SkillEnum.FIGHTING_BRAWL,
          },
        ],
      },
    ],
  },
  '242': {
    id: '242',
    story:
      '梅穿着一身朴素的睡衣开了门。你开始讲述关于鲜血和火焰的故事，她愣了一下，几乎马上就退回去，关上卧室门，不让露丝听到。\n她摇摇头：“阿博加斯特？你是着了什么魔，要听他的疯话？”她抓起外套，提上油灯，跟着你穿越夜幕下的村庄。当你们来到现场时，你只能看见草地上的血迹和焦糊印。但没有尸体。\n梅注视着你看了很长时间：“我们明早再详细地谈吧。我不能留下露丝一个人.”她转身离去。\n你没有多少选择余地，只能跟上。',
    options: [{ type: 'goto', text: '继续', goto: '157' }],
  },
  '243': {
    id: '243',
    story:
      '群星回应了你的号令，降落汇聚在灯塔上。你感到超脱尘世的光荣，你的身体在白炽的光和热中湮灭无存。\n你在世间罕有的炼狱之火中被烧死了！你想再尝试一次吗？\n【剧终】',
    options: [{ type: 'goto', text: '游戏结束', goto: 'END' }],
  },
  '244': {
    id: '244',
    story:
      '你推开门，走进了工坊。你的脸上有凉风拂过，还能看到屋檐里漏出光线。屋子正中有一块垫高的石板，略带坡度。石板下面有个豁口，表明里面放着什么东西。也许是盆？还有些东西盖着红布，平躺着堆在对面的墙上。看上去......像是人......',
    options: [
      { type: 'goto', text: '深入调查', goto: '250' },
      { type: 'goto', text: '已经看腻了', goto: '120' },
    ],
  },
  '245': {
    id: '245',
    story:
      '阿博加斯特的表情扭曲起来，带着疤的脸颊起了皱褶。\n“呸！他们的父母知道真相。他们听过。他们知道自己的结局，也知道自己在结局时的处境。他们理解自己内心的想法，做的都是不能形容的事。现在的人像小孩一样狂妄自大。所有事情都给他们准备好了，他们就以为永远会这样.”他瞪着洞顶。“他们说我要么就滚，要么就死。所以我把古老的咒语也带走了。但记住我说的话。站得越高，摔得越狠.”\n阿博加斯特用手撩了撩头发。他左边的头发缺了一大片，只有伤疤留在上面。他直起身来。',
    options: [{ type: 'goto', text: '继续', goto: '259' }],
  },
  '246': {
    id: '246',
    story:
      '在你的梦中，树木在挪动位置，它们的根须从地上拔起，拖着步子走到别处，又自己固定下来。这看上去完全正常，甚至算是友善。它们开始发光，是黄绿色的光，还有火舌在舔食——\n火？\n树木开始尖叫。\n闪烁的火舌蜿蜒爬上树，朝你扑来。你的腰带成了拴在火葬堆上的累赘。你拼命撕扯着腰带，咳嗽着，浓烟充斥着你的咽喉，令你窒息——',
    options: [
      {
        type: 'check',
        text: '进行“理智”检定',
        check: {
          details: {
            object: 'characteristic',
            subObject: CoreCharacteristicEnum.POW, // Sanity
            difficulty: CheckDifficulty.NORMAL,
          },
          onSuccessSceneId: '252',
          onFailureSceneId: '258',
          successText: '进行“理智”检定（成功）',
          failureText: '进行“理智”检定（失败）',
        },
      },
    ],
  },
  '247': {
    id: '247',
    story:
      '你倒在了落叶和烂泥覆盖的地面上。你晕乎乎的感觉自己被拖到马车旁，搭上了马背。浓郁的动物气味腔充满了你的鼻腔。你在马车上待了一小会儿，感觉十分恶心，意识时断时续......然后马停住了。你在马屁股的间隙看到了奇异的色彩。\n第一个车夫问道：“现在只好这样了，我们要拿这家伙怎么办？”\n“我想我们得把人藏起来.”他的伙伴用不确定的口气回答。\n你用余下的一点力气滑下马背，跌跌撞撞地摸进树林。树干歪歪扭扭地向你迫近，你的双腿没法支撑你走太远。你摔倒了。抓你的两个人哗啦啦穿过枝叶，来到你身后。\n“......别管了。我们走.”\n车夫的声音越来越远，很快你就又听到了马蹄哒哒的响声。你趴在长满青苔的地上，动弹不得。\n等到早晨，你才挣扎着站起身来，看着晨曦透过树丛，宣示着太阳的升起。\n恭喜！你已经度过了这次冒险。你可以保留自己的角色卡，在其他的《克苏鲁的呼唤》冒险中使用它。如果你在技能左边的方框里打过勾，你可以从经历中得到提升它们的机会。\n【剧终】',
    options: [{ type: 'goto', text: '游戏结束', goto: 'END' }],
  },
  '248': {
    id: '248',
    story:
      '你一把拉开门，准备好面对门外的家伙。\n门外的是梅，穿着她的睡衣外套。她警觉地后退了一步。\n她结结巴巴地说：“你看上去......不太对劲，我想看看你是不是不舒服.”\n你向梅保证自己非常健康，看着她回到了自己的卧室。卧室门一关，你就去厨房搬了一把椅子，把它顶在你的房门后面。这样的防御措施也许会令你安心睡上几个小时。',
    options: [{ type: 'goto', text: '继续', goto: '58' }],
  },
  '249': {
    id: '249',
    story:
      '你没有按通常的方式讲述自己的专业，而是兜了个圈子，只说自己帮助警察解决过各种各样的问题。一想到你得到了布莱克伍德侦探事务所的职位，你的心跳就会稍稍加速。你已经受够了婚姻不忠和银行职员受贿之类的调查；听上去布莱克伍德事务所恰好可以提供机会，让你积累起和真正的坏人斗争的经验。\n西拉斯眯起了眼睛，但什么话也没说。',
    info: '你的「信用评级」技能是20%。\n你的本职技能是：「艺术/手艺（摄影）」，「乔装」，「法律」，「图书馆使用」，「心理学」，「侦查」，还有「魅惑」、「话术」、「恐吓」、「说服」四项中其中一项。你还可以选择除了「克苏鲁神话」以外的其他任意一项技能作为学术专长或个人专长。\n将以下数值分配到各项本职技能当中，写到旁边的大方格里：70%，60%，60%，50%，50%，50%，40%，40%。分配时忽略调查员角色卡上已写出的初始值。',
    options: [{ type: 'goto', text: '继续', goto: '128' }],
  },
  '250': {
    id: '250',
    story:
      '你走近红布覆盖的人体，唯恐他们会一下子坐起来抓住你。人体有三具。每具人体的脚趾都系着一个标签：\n本杰明·克拉默，1927.1.19\n亚伯拉罕·霍林斯沃思，1927.4.22\n玛利安·菲普斯，1927.8.6\n你掀开苫布的一角。苫布下面毫无疑问是人体，枯瘦如柴，用绷带紧紧包裹。你正在看的是三具尸体。做过防腐的尸体。',
    options: [
      {
        type: 'check',
        text: '进行“理智”检定',
        check: {
          details: {
            object: 'characteristic',
            subObject: CoreCharacteristicEnum.POW, // Sanity
            difficulty: CheckDifficulty.NORMAL,
          },
          onSuccessSceneId: '256',
          onFailureSceneId: '256',
          successText: '理智检定成功',
          failureText: '理智检定失败',
          onFailureEffects: [{ type: EffectType.CHANGE_SANITY, value: '-1D2' }],
        },
      },
    ],
  },
  '251': {
    id: '251',
    story:
      '你问西拉斯他要怎么办。他烦厌地看了一眼发动机，才回答道：\n“我村里有认识的人。希望他们能还我个人情。不管怎样我都有地方睡，还管早饭.”他注视着自己肮脏的手，“热水澡恐怕指望不上.”\n你似乎没有什么选择。你从长途车顶取下了自己的行李。你最不希望发生的就是在陌生人的棚屋过了一夜之后，发现自己的全部家当不翼而飞了。',
    options: [{ type: 'goto', text: '继续', goto: '267' }],
  },
  '252': {
    id: '252',
    story:
      '这里有些东西不太对劲。即使你的手摸到、解开了腰带扣，你头脑中的一点理性还记得这火焰的样子并不自然。而且树不会自己挪动。\n腰带已经松脱，你从高空坠落。你能看到下面的影子吗？它们从黑暗中出现——\n失去1D3点耐久值。',
    options: [
      {
        type: 'goto',
        text: '继续',
        goto: '13',
        effects: [{ type: EffectType.CHANGE_HP, value: '-1D3' }],
      },
    ],
  },
  '253': {
    id: '253',
    story:
      '你直起身来，向后退到阳光下。阿博加斯特看着你退出，狂野地微笑。\n“又是个不敢听下去的家伙。被真相吓坏了。我给你最后一条忠告吧.”\n他蹲在地下的阴影里，阳光灼到他布满伤疤的脸上。\n“不要睡觉，陌生人。不要睡觉.”',
    options: [{ type: 'goto', text: '继续', goto: '160' }],
  },
  '254': {
    id: '254',
    story:
      '你悄悄溜回床上侧身躺下，闭上眼睛。门打开的时候，合页也跟着发出响声。然后好一会儿没有动静。\n屋里响起一阵脚步声，然后又是一阵。这声音很谨慎，像是女人的脚步。你稍等片刻，把眼睛睁开了一条缝。\n梅正背朝你蹲着。她在壁炉里摆弄着什么东西。',
    options: [
      { type: 'goto', text: '和梅对质', goto: '260' },
      { type: 'goto', text: '静观其变', goto: '266' },
    ],
  },
  '255': {
    id: '255',
    story:
      '你的命令阻止了群星下落的步伐，它们停滞不前，在村庄上空光芒流转，然后次第开始飘升。\n你听到村民喘息、倒抽气的声音，突然间一股深深的悲伤袭上你心头。然而，火势丝毫不减，火焰吞噬了你的身体。\n你在灯塔上被烧死了！\n但是，你确实已经短暂触碰到了超越地球的力量。为何不重新尝试呢？\n【剧终】',
    options: [{ type: 'goto', text: '游戏结束', goto: 'END' }],
  },
  '256': {
    id: '256',
    story:
      '“哟！我看你怎么偷偷摸摸的啊？喜不喜欢你的发现啊？”\n一个结实的村民堵住了屋门，把太阳光差不多都挡住了。你能辨认出深色的围裙和一副大胡子。他向前迈步，抬起了拳头。',
    options: [
      { type: 'goto', text: '不战而降', goto: '108' },
      { type: 'goto', text: '和工匠搏斗', goto: '262' },
    ],
  },
  '257': {
    id: '257',
    story:
      '你当面对西拉斯讲出你的怀疑。他的脸色阴沉下来，张开嘴露出一口七扭八歪的牙齿。\n“这车跟你们城里货能一样？”他啐道。“我累了一路，你倒享了一路福！想想吧，真是糟透了！”他大步趟到长途车后面，从行李架上扯下你的包裹，把它摔到你脚边的地上。“拿走！我怕你明天早上又要告我偷包！”\n他怒气难平地迈进了黑暗之中。这事本来应该解决得更好的。',
    options: [{ type: 'goto', text: '继续', goto: '267' }],
  },
  '258': {
    id: '258',
    story:
      '腰带松脱了，你跌入熊熊烈焰之中。地面瞬间撞上了你。\n失去1D2点理智值和1D3点耐久值。',
    options: [
      {
        type: 'goto',
        text: '继续',
        goto: '13',
        effects: [
          { type: EffectType.CHANGE_SANITY, value: '-1D2' },
          { type: EffectType.CHANGE_HP, value: '-1D3' },
        ],
      },
    ],
  },
  '259': {
    id: '259',
    story:
      '阿博加斯特在阴影中停顿了一下：“你有以前那些人没有过的东西。也许你能挺过去。如果你想知道更多，今天晚上再来找我。九点钟，在另一边的坟地.”他举起一根枯瘦的手指。“不要被人跟踪了，不然我就不去。这段时间可不是最后决战的时候.”\n阿博加斯特又用袖子抹了抹鼻子。“走吧。他们一直监视着我。还有，陌生人？别想着逃走。你成功不了的.”\n你退回阳光下。阳光刺目，你十分地动摇。\n你发现了一个秘密。今天晚些时候，会有文字提示你去继续之前的约定。到那时，如果你想再和阿博加斯特见面，在你所在的条目号上加20，前往对应的条目。',
    options: [
      {
        type: 'goto',
        text: '继续',
        goto: '160',
        effects: [
          {
            type: EffectType.SET_FLAG,
            gameFlag: 'APPOINTMENT_WITH_ABOGAIST_9PM_CEMETERY',
            flagValue: true,
          },
        ],
      },
    ],
  },
  '260': {
    id: '260',
    story:
      '你抬起腿下了床，和梅说话。梅吃惊跳了起来。\n她磕磕绊绊地说：“我......我觉得你可能会冷，我想我需要生个火......”\n她在背后用手抹掉了什么东西。\n你盯着她身后看，但壁炉里什么也看不到。\n“我不该吵醒你。对不起.”她着急要走。',
    options: [
      {
        type: 'check',
        text: '进行「恐吓」检定',
        check: {
          details: {
            object: 'skill',
            subObject: SkillEnum.INTIMIDATE,
            difficulty: CheckDifficulty.NORMAL,
          },
          onSuccessSceneId: '19',
          onFailureSceneId: '32',
          successText: '进行「恐吓」检定（成功）',
          failureText: '进行「恐吓」检定（失败）',
        },
      },
    ],
  },
}
